# TotalCurveLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..TotalCurveLength Property
MEPSection Class See Also
---
The total length of all segments in the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TotalCurveLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalCurveLength As Double
	Get
```

Visual C++
---
```text
public:
property double TotalCurveLength {
	double get ();
}
```

# Remarks
Default unit is Decimal feet. The unit type is UT_Length.
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace